//IBMUSER1 JOB ,'PROVISION DEV LIBS',
//            CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//            NOTIFY=&SYSUID
//         JCLLIB ORDER=(&SYSUID..LAB.PROCLIB)
// EXPORT SYMLIST=(HLQ)
// SET HLQ=PLAT01
//********************************************************************
//* SAMPLE JOB THAT ALLOCATES LIBRARIES FOR HYPOTHETICAL DEVELOPER
//********************************************************************
//DEVJCL   EXEC MAKELIB,HLQ=PLAT01,LIBNAME=DEV.JCL
//TSTJCL   EXEC MAKELIB,HLQ=PLAT01,LIBNAME=TST.JCL
//DEVPROC  EXEC MAKELIB,HLQ=PLAT01,LIBNAME=DEV.PROCLIB
//TSTPROC  EXEC MAKELIB,HLQ=PLAT01,LIBNAME=TST.PROCLIB
//********************************************************************
//* SEED DEV JCL SOURCE LIBRARY WITH DEFAULT MEMBERS
//********************************************************************
//SEEDJCL   EXEC PGM=IEBCOPY,COND=(0,GT)
//SYSPRINT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//JCLSEED   DD DSN=&SYSUID..LAB.SEED.JCL,DISP=SHR
//JCLOUT    DD DSN=&HLQ..DEV.JCL,DISP=SHR
//PROCOUT   DD DSN=&HLQ..DEV.PROCLIB,DISP=SHR
//SYSIN     DD *
COPYOPER COPY OUTDD=JCLOUT,INDD=JCLSEED
         SELECT MEMBER=(ASM,HELLO)
COPYOPER COPY OUTDD=PROCOUT,INDD=JCLSEED
         SELECT MEMBER=(ASMBIND)
/*
//*
//********************************************************************
//* ALLOCATE SOURCE LIBRARIES FOR ASSEMBLER SOURCE AND MACROS
//********************************************************************
//IBMUSER2 JOB ,'ALLOC ASSEMBLER LIBS',
//            CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//            NOTIFY=&SYSUID
//         JCLLIB ORDER=(&SYSUID..LAB.PROCLIB)
// EXPORT SYMLIST=(HLQ)
// SET HLQ=PLAT01
//DEVASM   EXEC MAKELIB,HLQ=PLAT01,LIBNAME=DEV.ASM,PRI=10,SEC=4
//DEVMAC   EXEC MAKELIB,HLQ=PLAT01,LIBNAME=DEV.MACLIB
//TSTASM   EXEC MAKELIB,HLQ=PLAT01,LIBNAME=TST.ASM
//TSTMAC   EXEC MAKELIB,HLQ=PLAT01,LIBNAME=TXT.MACLIB
//SNIPASM  EXEC MAKELIB,HLQ=PLAT01,LIBNAME=SNIPPETS.ASM
//********************************************************************
//* SEED DEV ASSEMBLER SOURCE LIBRARIES WITH SAMPLE MEMBERS
//********************************************************************
//SEEDJCL   EXEC PGM=IEBCOPY,COND=(0,GT)
//SYSPRINT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//ASMSEED   DD DSN=&SYSUID..LAB.SEED.ASM,DISP=SHR
//ASMOUT    DD DSN=&HLQ..DEV.ASM,DISP=SHR
//SYSIN     DD *
COPYOPER COPY OUTDD=ASMOUT,INDD=ASMSEED
         SELECT MEMBER=HELLO
/*
//*
//********************************************************************
//* ALLOCATE SOURCE LIBRARIES FOR REXX SCRIPTS
//********************************************************************
//IBMUSER3 JOB ,'ALLOC REXX LIBS',
//            CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//            NOTIFY=&SYSUID
//         JCLLIB ORDER=(&SYSUID..LAB.PROCLIB)
// EXPORT SYMLIST=(HLQ)
// SET HLQ=PLAT01
//DEVREXX  EXEC MAKELIB,HLQ=PLAT01,LIBNAME=DEV.REXX
//TSTREXX  EXEC MAKELIB,HLQ=PLAT01,LIBNAME=TXT.REXX
//*
//********************************************************************
//* ALLOCATE SOURCE LIBRARIES FOR COBOL SOURCE AND COPYBOOKS
//********************************************************************
//DEVCOB   EXEC MAKELIB,HLQ=PLAT01,LIBNAME=DEV.COBOL,PRI=20,SEC=10
//DEVCPY   EXEC MAKELIB,HLQ=PLAT01,LIBNAME=DEV.COPYLIB,PRI=12,SEC=4
//TSTCOB   EXEC MAKELIB,HLQ=PLAT01,LIBNAME=TST.COBOL,PRI=20,SEC=10
//TSTCPY   EXEC MAKELIB,HLQ=PLAT01,LIBNAME=TST.COPYLIB,PRI=12,SEC=4
//SNIPCOB  EXEC MAKELIB,HLQ=PLAT01,LIBNAME=SNIPPETS.COBOL
//*
//********************************************************************
//* ALLOCATE PROGRAM LIBRARIES FOR AN APPLICATION DEVELOPER
//********************************************************************
//IBMUSER4 JOB ,'ALLOC PROGRAM LIBS',
//            CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//            NOTIFY=&SYSUID
//         JCLLIB ORDER=(&SYSUID..LAB.PROCLIB)
// EXPORT SYMLIST=(HLQ)
// SET HLQ=PLAT01
//DEVPLIB  EXEC MAKEPLIB,HLQ=PLAT01,LIBNAME=DEV.PROGLIB,PRI=10,SEC=4
//TSTPLIB  EXEC MAKEPLIB,HLQ=PLAT01,LIBNAME=TST.PROGLIB,PRI=10,SEC=4          