//HELLOJOB JOB (ACCT),'HELLO',CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//* Lab 9/10: copy SYSUT1 to SYSUT2 with IEBGENER.
//*
//STEP1    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
HELLO FROM ANSIBLE ON ZOS
//SYSUT2   DD SYSOUT=*
//SYSIN    DD DUMMY
